In [3]:
# Merging and Joining Data
import pandas as pd

In [4]:
employees = pd.DataFrame({
    "EmpID": [1,2,3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10,20,30]
})

departments = pd.DataFrame({
    "DeptID": [10,20,40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [5]:
pd.merge(employees,departments, on="DeptID") # Inner join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [6]:
# Left join 
pd.merge(employees,departments, on="DeptID", how="left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [7]:
# Right join 
pd.merge(employees,departments, on="DeptID", how="right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [9]:
# Outer join
pd.merge(employees,departments, on="DeptID", how="outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

# Concatenating DataFrame

. We will use pd.concat() to concatenat dataframe

In [11]:
# Vertical (rows)
df1 = pd.DataFrame({"Name": ["Alice","Rohit"]})
df2 = pd.DataFrame({"Name": ["Ashutosh","Santosh"]})

In [12]:
pd.concat([df1,df2])

       Name
0     Alice
1     Rohit
0  Ashutosh
1   Santosh

In [13]:
# Horizontal (columns)
df1 = pd.DataFrame({"Name": ["Alice","Rohit"]})
df2 = pd.DataFrame({"Name": ["Ashutosh","Santosh"]})

In [14]:
pd.concat([df1,df2],axis=1)

    Name      Name
0  Alice  Ashutosh
1  Rohit   Santosh

In [15]:
# Vertical (rows)
df1 = pd.DataFrame({"Name": ["Alice","Rohit"], "Score": [98,57]})
df2 = pd.DataFrame({"Name": ["Ashutosh","Santosh"], "Age": [9,10]})

In [17]:
pd.concat([df1,df2])

       Name  Score   Age
0     Alice   98.0   NaN
1     Rohit   57.0   NaN
0  Ashutosh    NaN   9.0
1   Santosh    NaN  10.0

In [18]:
# Vertical (rows)
df1 = pd.DataFrame({"Name": ["Alice","Rohit"], "Score": [98,57]})
df2 = pd.DataFrame({"Name": ["Ashutosh","Santosh"], "Age": [9,10]})

In [19]:
pd.concat([df1,df2], axis=1)

    Name  Score      Name  Age
0  Alice     98  Ashutosh    9
1  Rohit     57   Santosh   10